# coding=utf-8
#常规状态
STATUS = (
    (200, u'正常'),
    (201, u'结束的'),
    (206, u'占用'),
    (403, u'失效'),
    (405, u'等待授权'),
    (0, u'删除'),
)

#地域层级
LOCATION_LEVEL = (
    (0, u'层次标记'), #不显示也不被应用，仅体现层级关系
    (2, u'省份'), #包括省、直辖市
    (3, u'城市'), #包括省会城市、地级市
    (5, u'区/县'), #包括区、县级市
    (7, u'街道'), #后续可以更为细分地址的结构
)
#用户主管等级
USER_LEVEL = (
    (0, u'员工'),
    (1, u'专项主管'),
    (2, u'部门主管'),
    (3, u'部门总监'),
    (4, u'体系主管'),
    (5, u'公司主管'),
)

#产品种类
PRODUCT_CATEGORID = (
    (10, u'域名/空间'),
    (20, u'网站/小程序'),
    (21, u'落地页'),
    (30, u'视频'),
    (70, u'服务'),
    (0, u'其他'),
)